# ðŸ“Œ Pandas Complete Guide: Beginner to Advanced

Pandas is used for data manipulation and analysis.  
Main data structures: **Series** and **DataFrame**.

---

## ðŸ”¹ 1. Import Pandas
```python
import pandas as pd

In [2]:
import pandas as pd

##### ðŸ”¹ 2. Pandas Series

In [3]:
data = pd.Series([10, 20, 30, 40])
print(data)

0    10
1    20
2    30
3    40
dtype: int64

##### ðŸ”¹ 3. Pandas DataFrame

In [4]:
data = {
    "Name": ["Ali", "Ahmed", "Sara"],
    "Age": [20, 22, 21],
    "Marks": [85, 90, 88]
}

df = pd.DataFrame(data)
print(df)

    Name  Age  Marks
0    Ali   20     85
1  Ahmed   22     90
2   Sara   21     88

##### ðŸ”¹ 4. Reading Data

In [5]:
df = pd.read_csv("data.csv")

##### ðŸ”¹ 5. Data Inspection

In [6]:
print(df.head())
print(df.tail())
print(df.info())
print(df.describe())

    Name  Age  Marks Grade
0    Ali   20     85     A
1  Ahmed   22     90    A+
2   Sara   21     88     A
3   Hina   19     92    A+
4   Omar   23     75     B
    Name  Age  Marks Grade
1  Ahmed   22     90    A+
2   Sara   21     88     A
3   Hina   19     92    A+
4   Omar   23     75     B
5   Zara   20     80    B+
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Marks   6 non-null      int64
 3   Grade   6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes
None
             Age      Marks
count   6.000000   6.000000
mean   20.833333  85.000000
std     1.471960   6.449806
min    19.000000  75.000000
25%    20.000000  81.250000
50%    20.500000  86.500000
75%    21.750000  89.500000
max    23.000000  92.000000

##### ðŸ”¹ 6. Selecting Data

In [10]:
print(df["Name"])
print(df[["Name", "Marks"]])

0      Ali
1    Ahmed
2     Sara
3     Hina
4     Omar
5     Zara
Name: Name, dtype: object
    Name  Marks
0    Ali     85
1  Ahmed     90
2   Sara     88
3   Hina     92
4   Omar     75
5   Zara     80

Row selection:

In [14]:
print(df.loc[0])
print(df.iloc[1])

Name     Ali
Age       20
Marks     85
Grade      A
Name: 0, dtype: object
Name     Ahmed
Age         22
Marks       90
Grade       A+
Name: 1, dtype: object

##### ðŸ”¹ 7. Filtering Data

In [17]:
print(df[df["Marks"] > 85])
print(df[(df["Age"] > 20) & (df["Marks"] > 80)])

    Name  Age  Marks Grade
1  Ahmed   22     90    A+
2   Sara   21     88     A
3   Hina   19     92    A+

##### ðŸ”¹ 8. Adding & Removing Columns

In [20]:
# df["Grade"] = ["A", "A+", "A"]
# df.drop("Age", axis=1, inplace=True)

##### ðŸ”¹ 9. Handling Missing Values

In [21]:
df.isnull()
df.dropna()
df.fillna(0)

    Name  Age  Marks Grade
0    Ali   20     85     A
1  Ahmed   22     90    A+
2   Sara   21     88     A
3   Hina   19     92    A+
4   Omar   23     75     B
5   Zara   20     80    B+

##### ðŸ”¹ 10. GroupBy

In [22]:
df.groupby("Grade")["Marks"].mean()

Grade
A     86.5
A+    91.0
B     75.0
B+    80.0
Name: Marks, dtype: float64

##### ðŸ”¹ 11. Sorting

In [23]:
df.sort_values(by="Marks", ascending=False)

    Name  Age  Marks Grade
3   Hina   19     92    A+
1  Ahmed   22     90    A+
2   Sara   21     88     A
0    Ali   20     85     A
5   Zara   20     80    B+
4   Omar   23     75     B

##### ðŸ”¹ 12. Apply Function

In [28]:
df["Marks"] = df["Marks"].apply(lambda x: x + 5)

##### ðŸ”¹ 13. Real-World Example

In [29]:
sales = {
    "Month": ["Jan", "Feb", "Mar"],
    "Revenue": [20000, 25000, 30000]
}

df = pd.DataFrame(sales)
print(df["Revenue"].mean())

25000.0